import re


text = [['横桁 Cr0803', '⑦剥離・鉄筋露出-d', '写真番号-15', '9月7日 S458(前-8)', ['543207.0862507953', '218366.5575399188'], ['545418.5774821687', '218368.3759352968']], ['主桁 Mg0901', '⑰その他(分類6:異物混入)-e', '写真番号-2', '9月7日 S404(前-1)', ['532240.3861927793', '218366.5575399188'], ['534192.8564975171', '218396.3930096343']], ['横桁 Cr0201,0301,0402,0403,0602,0604,0704', '⑦剥離・鉄筋露出-d'], ['床版 Ds0201,0203', '⑦剥離・鉄筋露出-d'], ['排水管 Dp0201,0202', '①腐食(小大)-c,⑤防食機能の劣化(分類1)-e'], ['横桁 Cr0801', '⑦剥離・鉄筋露出-d', '写真番号-12', '9月7日 S525(前-3)', ['527566.5420863405', '220430.3566962297'], ['527793.2963477422', '220070.4196068052']], ['排水管 Dp0101', '①腐食(大大)-e', '⑤防食機能の劣化(分類1)-e', '写真番号-31', '9月7日 S422(前-23)', ['538482.3557216563', '229268.8593029478'], ['538810.3087944178', '228910.3502713814']], ['横桁 Cr0802', '⑦剥離・鉄筋露出-d', '写真番号-13,14', '9月7日 S396,S412(前-4)', ['538443.3187868086', '218366.5575399188'], ['538761.6085522854', '218087.1577589952']], ['床版 Ds0803', '⑦剥離・鉄筋露出-d', '写真番号-17', '9月7日 S465(前-12)', ['544955.785269761', '220430.3566962297'], ['545192.2035962', '220088.065259854']], ['横桁 Cr0503', '⑦剥離・鉄筋露出-d', '⑰その他(分類6:施工不良)-e', '写真番号-10,11', '9月7日 S450,S452(前-6,7)', ['546181.340571892', '222553.0807470059'], ['546769.9402349197', '222164.8389810835']], ['横桁 Cr0401', '⑦剥離・鉄筋露出-e', '写真番号-9', '9月7日 S523(前-2)', ['529221.0193919685', '223295.995449547'], ['529401.0143646629', '222981.8261548198']], ['床版 Ds0101', '⑦剥離・鉄筋露出-d', '写真番号-16', '9月7日 S497(前-11)', ['531595.7611265536', '227530.3566962298'], ['531805.9667048807', '227218.1705246582']]]

replacement_patterns = {
    "①腐食(大大)-e": "板厚減少を伴う腐食",
    "⑤防食機能の劣化(分類1)-e": "防食機能の劣化",
    "⑦剥離・鉄筋露出-c": "コンクリートの剥離",
    "⑦剥離・鉄筋露出-d": "鉄筋露出",
    "⑦剥離・鉄筋露出-e": "著しい鉄筋露出",
    "⑳漏水・滞水-e": "漏水・滞水",
}

# << ①と⑤があるとき、⑤を消す >>
for sublist in text:
# リスト内の要素を走査して、先頭が「①」の要素が存在するかチェックする
    if any(item.startswith('①') for item in sublist):
        # 「①」で始まる要素があれば、「⑤」で始まる要素を全て削除
        # サブリストのコピー上でイテレーションを行いながら、元のサブリストを編集
        sublist[:] = [item for item in sublist if not item.startswith('⑤')]
        
# << ⑰のとき、「⑰その他(分類6:)-e」を消す >>    
    new_sublist = []  # sublistを更新するための一時リスト
    for item in sublist:
        if item.startswith('⑰'):
            # 正規表現を使って「:」から「)-e」までの文字列を抽出する
            match = re.search(r':(.*?)(?=\)-e)', item)
            if match:
                # 抽出した部分をsublistに追加
                new_sublist.append(match.group(1))
        else:
            new_sublist.append(item)
    sublist[:] = new_sublist

    second_replaced = "、".join(replacement_patterns.get(char, char) for char in sublist)

    print(second_replaced)